app/views/static_pages/home.html.erb

	</tr>
	<% Task.tasks_expired(current_user.id).each do |task| %>
---
SELECT `tasks`.* FROM `tasks` WHERE (user_id= 1 and due_date ='2013-02-17')