app/controllers/tasks_controller.rb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
---
  def edit
    @task = Task.find(params[:id])

INSERT INTO `tasks` (`created_at`, `due_date`, `name`, `priority`, `updated_at`, `user_id`) VALUES ('2013-02-17 16:53:09', '2013-02-17', 'dasda', 2, '2013-02-17 16:53:09', 1)
---
  def create
    @task = Task.new(params[:task])
    @task.user_id = current_user.id
    if @task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1
UPDATE `tasks` SET `priority` = 4, `updated_at` = '2013-02-17 17:25:46' WHERE `tasks`.`id` = 2
---
  def update
    @task = Task.find(params[:id])

    if @task.update_attributes(params[:task])